---
title: WorksetPreview
classe: Autodesk.Revit.DB.WorksetPreview
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# WorksetPreview

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `WorksetId Id { get; }` | `worksetPreview.Id` | WorksetId |
| `Boolean IsDefaultWorkset { get; }` | `worksetPreview.IsDefaultWorkset` | Boolean |
| `Boolean IsValidObject { get; }` | `worksetPreview.IsValidObject` | Boolean |
| `String Name { get; }` | `worksetPreview.Name` | String |
| `String Owner { get; }` | `worksetPreview.Owner` | String |
| `Guid UniqueId { get; }` | `worksetPreview.UniqueId` | Guid |
| `Void Dispose()` | `worksetPreview.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```